module.exports = {
    Currency: 'MDL',
    Pcs: 'шт.',
    Locale: 'ru-RU',
    Error: '❌ Ошибка!',
    Goods: '📃 Товар',
    Cart: '🛒 Корзина',
    Orders: '🧾 Заказы',
    Brands: '🛍 Бренды',
    Categories: '📂 Категории',
    start: {
        welcome: 'Добро пожаловать в NextLevelShop!',
        sharePhoneToStart: 'Чтобы начать работу нажмите "Поделиться номером телефона 👇"',
        sharePhone: '📱 Поделиться номером телефона',
        goodsMenu: '📃 Товар'
    },
    mainMenu: {
        notFound: '😔 Не найдено',
        makeChoice: 'Сделайте выбор 👇',
        errorTryAgain: '⚠️ Возникла ошибка, попробуйте ещё раз раз.'
    },
    products: {
        page: 'Выберите страницу 👇',
        goodsNotFound: '😔 Товаров не найдено.',
        addToCart: '➕ Добавить в корзину',
        errorLoadingInfo: '⚠️ Не удалось загрузить информацию',
        chooseQuantity: 'Выберите количество 👇',
        alreadyAdded: '✅ Уже в корзине',
        errorAddingToCart: 'Ошибка при добавлении в корзину:',
        added: '🛒 Добавлено:',
    },
    cart: {
        yourCartIsEmpty: '🛒 Ваша корзина пуста.',
        yourCart: '🛒 Ваша корзина:',
        quantity: 'Количество: ',
        totalSum: '💰 Общая сумма:',
        delete: '🗑 Удалить',
        emptyCart: '🧹 Очистить корзину',
        doCheckout: '✏ Оформить заказ'
    },
    checkout: {
        emptyCartImpossibleToCheckout: '❗ Ваша корзина пуста, невозможно оформить заказ',
        choosePaymentType: 'Выберите тип оплаты 👇',
        cash: 'Наличный',
        card: 'Безналичный',
        yourProfile: 'Ваш профиль:',
        name: '👤 Имя:',
        address: '🏠 Адрес:',
        isAllCorrect: 'Всё верно?',
        changeName: '🖊 Изменить имя',
        changeAddress: '🖊 Изменить адрес',
        typeYourName: 'Введите ваше имя: ',
        typeNewName: 'Введите новое имя',
        nameTooShort:'⚠️ Имя должно содержать не менее 2 символов',
        typeShipmentAddress: 'Введите адрес доставки: ',
        addressTooShort: '⚠️ Адрес должен содержать не менее 5 символов.',
        confirmAndCompleteOrder: '✅ ПОДТВЕРДИТЬ И ЗАВЕРШИТЬ ЗАКАЗ',
        orderNumber: '✅ Заказ №',
        completedSuccessfully: 'успешно оформлен!',
        yourOrder: '🧾 Ваш заказ: ',
        total: 'Итого: ',
        payment: '💳 Оплата: ',
        errorDuringCheckout: '⚠ Возникла ошибка при создании заказа. Попробуйте ещё раз'
    },
    orders: {
        noOrdersYet: 'Заказов пока ещё нет, чтобы создать заказ перейдите в меню "Товар". 👇',
        yourOrders: 'Ваши заказы:',
        total: '💰 Итого: '
    },
    notification: {
        newOrder: 'Новый заказ',
        customer: '👤 Клиент: ',
        phone: '📞 Телефон: ',
        date: '🗓️ Дата: ',
        sum: '💰 Сумма: ',
        goods: 'Товары: '
    }
}